Repository: ondrejd/odwp-debug_log
Catalog: languages/odwpdl-*.po
Languages: cs_cz

source: Used PHP interpreter doesn't meet requirements of this plugin (is required version <b>%1$s</b> at least)!
cs_cz: Použitý PHP interpretr nesplňuje nároky tohoto pluginu (je vyžadována alespoň verze <b>%1$s</b>)!

source: PHP extension <b>%1$s</b> is required but not installed!
cs_cz: Je vyžadováno PHP rozšíření <b>%1$s</b>, to ale není nainstalováno!

source: This plugin requires higher version of <b>WordPress</b> (at least version <b>%1$s</b>)!
cs_cz: Tento plugin vyžaduje vyšší verzi platformy <b>WordPress</b> (alespoň <b>%1$s</b>)!

source: The plugin <b>%1$s</b> is required but not installed!
cs_cz: Plugin <b>%1$s</b> je vyžadován, ale není aktivován!

source: Use function `odwpdl_write_log` instead!
cs_cz: Použijte místo této funkce funkci `odwpdl_write_log`!

source: <b>Debug Log Viewer</b>:
cs_cz: <b>Prohlížeč ladících informací</b>:

source: Source file <code>%1$s</code> was not found!
cs_cz: Zdrojový soubor <code>%1$s</code> nebyl nalezen!

source: Source file <code>%1$s</code> can not be read!
cs_cz: Zdrojový soubor <code>%1$s</code> nejde přečíst!

source: Debug Log
cs_cz: Ladící informace

source: Debug Log Viewer
cs_cz: Prohlížeč ladících informací

source: General
cs_cz: Obecné

source: Debug log table contains all records from <code>debug.log</code> file.
cs_cz: Tabulka s ladícími informacemi obsahuje všechny záznamy ze souboru <code>debug.log</code>.

source: Table columns
cs_cz: Sloupce tabulky

source: Record number
cs_cz: Číslo záznamu

source: Record (line) number of the record
cs_cz: Číslo záznamu (řádku)

source: Date and time
cs_cz: Datum a čas

source: Date and time when was record added
cs_cz: Datum a čas, kdy byl záznam přidán

source: Record type
cs_cz: Typ záznamu

source: Type of record (see table below)
cs_cz: Typ záznamu (podívejte se na tabulku níže)

source: Record
cs_cz: Záznam

source: Text of record (including <em>stack trace</em>)
cs_cz: Text záznamu (včetně <em>postupu kódu</em>)

source: Record types
cs_cz: Typy záznamů

source: Types of records
cs_cz: Typy záznamu

source: Fatal error
cs_cz: Chyba

source: Error notice
cs_cz: Oznámení

source: Other errors
cs_cz: Jiné chyby

source: PHP parser error
cs_cz: Chyba parseru

source: Warning notice
cs_cz: Varování

source: Debug log parser error
cs_cz: Chyba parseru ladících informací

source: Useful links
cs_cz: Užitečné odkazy

source: Author's homepage
cs_cz: Domovská stránka autora

source: GitHub - source codes
cs_cz: GitHub - zdrojové kódy

source: GitHub - issues
cs_cz: GitHub - chyby

source: Displayed columns
cs_cz: Zobrazené sloupce

source: Count of records per page
cs_cz: Počet záznamů na stránku

source: Make links to source files shorter?
cs_cz: Zkracovat názvy souborů se zdrojovými kódy?

source: Show record type as an icon?
cs_cz: Zobrazit typy záznamů jako ikonu?

source: Show links to source files?
cs_cz: Zobrazit odkazy na soubory se zdrojovými kódy?

source: Show <em>stack trace</em> defaultly unfolded?
cs_cz: Zobrazit <em>postup kódu</em> rovnou rozbalený?

source: Defaultly sorted column
cs_cz: Defaultně seřazený sloupec

source: Default sort direction
cs_cz: Defaultní směr řazení

source: Width of modal window with source codes
cs_cz: Šířka okna se zdrojovými kódy

source: Height of modal window with source codes
cs_cz: Výška okna se zdrojovými kódy

source: Do you really want to delete whole <code>debug.log</code> file?
cs_cz: Skutečně chcete smazat celý soubor <code>debug.log</code>?

source: Do you really want to delete selected record?
cs_cz: Skutečně chcete smazat vybraný záznam?

source: Records
cs_cz: Záznamy

source: Error
cs_cz: Chyba

source: Notice
cs_cz: Oznámení

source: Other
cs_cz: Ostatní

source: Parser error
cs_cz: Chyba parseru

source: Warning
cs_cz: Varování

source: Debug Log Parser Error
cs_cz: Chyba parseru ladících informací

source: Stack trace
cs_cz: Postup kódu

source: Delete
cs_cz: Smazat

source: Type
cs_cz: Typ

source: Today
cs_cz: Dnes

source: Yesterday
cs_cz: Včera

source: Earlier
cs_cz: Dříve

source: All
cs_cz: Vše

source: —— All ——
cs_cz: —— Vše ——

source: Error (%d)
cs_cz: Chyba (%d)

source: Notice (%d)
cs_cz: Oznámení (%d)

source: Parser error (%d)
cs_cz: Chyba parseru (%d)

source: Warning (%d)
cs_cz: Varování (%d)

source: Other (%d)
cs_cz: Ostatní (%d)

source: Debug Log parser error (%d)
cs_cz: Chyba parseru ladících informací (%d)

source: There are no items with filter or view you have selected&hellip;
cs_cz: Zvolenému filtru nebo pohledu neodpovídají žádné záznamy&hellip;

source: Your file <code>debug.log</code> is empty &ndash; that means no errors <strong class="noitems-smiley">:-)</strong>&hellip;
cs_cz: Váš soubor <code>debug.log</code> je prázdný &ndash; to znamená žádné chyby <strong class="noitems-smiley">:-)</strong>&hellip;

source: Nothing deleted - no records were selected.
cs_cz: Protože žádné záznamy nebyly vybrány, nebylo nic smazáno.

source: Error occurs during deleting records from <code>debug.log</code> file.
cs_cz: Při mazání záznamů ze souboru <code>debug.log</code> nastala chyba.

source: Deleting was successful (deleted records: <strong>%1$d</strong>).
cs_cz: Mazání záznamů bylo úspěšné (smazaných záznamů: <strong>%1$d</strong>).

source: No records from <code>debug.log</code> were deleted.
cs_cz: Žádné záznamy ze souboru <code>debug.log</code> nebyly smazány.

source: Some records were deleted but other not (deleted/not deleted records: <strong>%1$d/%2$d</strong>).
cs_cz: Některé záznamy byly smazány, některé ne (počty smazaných/nesmazaných záznamů: <strong>%1$d/%2$d</strong>).

source: Nonce is not valid. Please try your request again.
cs_cz: Bezpečnostní kód není platný. Zkuste opakovat váš požadavek.

source: Something went wrong so log record with ID <strong>%d</strong> was not deleted!
cs_cz: Při mazání záznamu s ID <strong>%d</strong> se něco pokazilo a záznam tak nebyl smazán!

source: Record on line <strong>%d</strong> was successfully removed from <code>debug.log</code> file.
cs_cz: Záznam na řádku <strong>%d</strong> souboru <code>debug.log</code> byl úspěšně smazán.

source: Record on line <strong>%d</strong> from <code>debug.log</code> file was not deleted!
cs_cz: Záznam na řádku <strong>%d</strong> souboru <code>debug.log</code> nebyl úspěšně smazán!

source: %s item
cs_cz: %s položka

source: First page
cs_cz: První stránka

source: Previous page
cs_cz: Předchozí stránka

source: Current Page
cs_cz: Aktuální stránka

# paging
source: %1$s of %2$s
cs_cz: %1$s z %2$s

source: Next page
cs_cz: Další stránka

source: Last page
cs_cz: Poslední stránka

source: Select All
cs_cz: Vybrat vše

source: An error occurred - no record was deleted.
cs_cz: Při mazání nastala chyba - žádný záznam nebyl smazán.

source: Record with ID <strong>%s</strong> was deleted.
cs_cz: Záznam s ID <strong>%s</strong> byl smazán.

source: NONCE is not valid - <code>debug.log</code> file was not deleted!
cs_cz: NONCE není platné - obsah souboru <code>debug.log</code> nebyl smazán!

source: All records from the <code>debug.log</code> file was deleted.
cs_cz: Všechny záznamy ze souboru <code>debug.log</code> byly vymazány.

source: An error occurred during clearing <code>debug.log</code> file.
cs_cz: Při mazání obsahu souboru <code>debug.log</code> nastala chyba.

source: Wrong log screen action was specified!
cs_cz: Byla specifikována chybná akce pro tuto obrazovku!

source: Show Debug Log Viewer
cs_cz: Zobrazit Prohlížeč ladících informací

source: <strong>Debug Log Viewer</strong>: File (<code>%s</code>) was successfully created.
cs_cz: <strong>Prohlížeč ladících informací</strong>: Soubor (<code>%s</code>) byl úspěšně vytvořen.

source: <strong>Debug Log Viewer</strong>: File (<code>%s</code>) doesn't exist and can't be created. Create it on your own.
cs_cz: <strong>Prohlížeč ladících informací</strong>: Soubor (<code>%s</code>) neexistuje a ani nemůže být vytvořen. Musíte jej vytvořit sami.

source: <strong>Debug Log Viewer</strong>: File (<code>%s</code>) exists but is not writeable.
cs_cz: <strong>Prohlížeč ladících informací</strong>: Soubor (<code>%s</code>) existuje, ale není zapisovatelný.

source: If you want to write log records into (<code>%s</code>) file you need to set PHP constants <code>WP_DEBUG</code> and <code>WP_DEBUG_LOG</code> on value <code>TRUE</code>.
cs_cz: Pokud chcete, aby se ladící informace zapisovaly do souboru (<code>%s</code>) musíte nastavit PHP konstanty <code>WP_DEBUG</code> a <code>WP_DEBUG_LOG</code> na hodnotu <code>TRUE</code>.

source: Delete log
cs_cz: Smazat záznamy

source: Show nice log
cs_cz: Zobrazit pěkný výpis

source: Show raw log
cs_cz: Zobrazit čistý záznam

source: Here are untouched contents of %1$sdebug.log%2$s file. Its size is %3$s%5$s%4$s, total count of lines is %3$s%6$d%4$s.
cs_cz: Níže si můžete prohlédnout neupravený obsah souboru %1$sdebug.log%2$s. Jeho velikost je %3$s%5$s%4$s, počet řádků je %3$s%6$d%4$s.

source: Filter records
cs_cz: Filtrovat záznamy

source: Log records
cs_cz: Ladící informace

source: Filter by type
cs_cz: Filtrovat dle typu

source: Filter
cs_cz: Filtr

source: Screen Options Tab
cs_cz: Nastavení zobrazení

source: Table screen options
cs_cz: Nastavení zobrazení tabulky

source: Displayed columns:
cs_cz: Zobrazené položky:

source: Gray items are displayed by default and can't hidden.
cs_cz: Šedé položky jsou zobrazeny vždy a nemohou být skryty.

source: Count of records per page:
cs_cz: Počet záznamů na stránku:

source: Check if you want to see record type as an icon not as a normal text.
cs_cz: Zaškrtněte pokud chcete zobrazit typ záznamu jako ikonu a ne jako normální text.

source: Create links to source files?
cs_cz: Zobrazit odkazy na zdrojové kódy?

source: Check if you want to create links to source files where was error occured.
cs_cz: Zaškrtněte pokud chcete zobrazit odkazy na soubory se zdrojovými kódy, ve kterých se chyba stala.

source: Show source file names shortened?
cs_cz: Zobrazit názvy zdrojových souborů zkrácené?

source: Show source file names shortened (e.g. without absolute path <code>ABSPATH</code>)?
cs_cz: Zobrazit názvy souborů se zdrojovými kódy zkrácené (tzn. bez absolutní cesty <code>ABSPATH</code>)?

source: Show stack trace defaultly unfolded?
cs_cz: Zobrazit postup kódem defaultně rozbalený?

source: Check if you want to have <em>stack trace</em> defaultly unfolded.
cs_cz: Zaškrtněte pokud chcete ponechat <em>postup kódem</em> defaultně rozbalený.

source: Set width and height for the modal window with source codes. Width:
cs_cz: Nastavte šířku a výšku okna se zdrojovými kódy. Šířka:

source: , height:
cs_cz: , výška:

source: This option has effect only when creating source files links is enabled (see above).
cs_cz: Tato volba má vliv pouze pokud je povoleno zobrazení odkazů na soubory se zdrojovými kódy (viz. výše).

source: Set column which will be sorted by default
cs_cz: Nastavte sloupec, který bude seřazen defaultně

source: and its order
cs_cz: a také řazení

source: Ascendant
cs_cz: Vzestupně

source: Descendant
cs_cz: Sestupně

source: Save settings
cs_cz: Uložit nastavení
